src/cfe/КСП/Catalogs/КСП_СвойстваМетодов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>КСП_СвойстваМетодов</Name>
			<Comment>Методы, запускаемые через УправлениеЗаданиями, могут иметь настройки в этом справочнике</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПараллельныхПроцессов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прерывание</Name>
					<Comment>флаг прерывания работы задания. используется для корректного завершения длительных процессов</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Константы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/КСП/Catalogs/КСП_СвойстваМетодов/Ext/ManagerModule.bsl
// Создает запись с указанным количеством фоновых процессов.
// В параметре Наименование нужно указывать имя того метода,
// который будет запускаться в фоне.
// Если запись уже существует и количество фоновых процессов не равно нулю,
// то оно не изменяется!
//
// Параметры:
//	Наименование 	- строка 	- имя метода с префиксом в виде общего модуля: ОбщийМодуль1.ИмяМетода()
//	Лимит			- число		- макс. количество фоновых процессов с этим методом.
//
Процедура УстановитьЛимитФоновыхПроцессов(Наименование, Лимит, ИдВызова = Неопределено, Обновлять = Ложь) Экспорт

	СпрСсылка = Справочники.КСП_СвойстваМетодов.НайтиПоНаименованию(Наименование, Истина);
	
	Если СпрСсылка = Справочники.КСП_СвойстваМетодов.ПустаяСсылка() Тогда
		
		Р = Справочники.КСП_СвойстваМетодов.СоздатьЭлемент();
		Р.Наименование = Наименование;
		Р.ПараллельныхПроцессов = Лимит;
		Р.Записать();
		
	Иначе
		Если Обновлять = Ложь Тогда
		
			Возврат;
		
		КонецЕсли;
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить();
		ЭлементБлокировки.Область = "Справочник.КСП_СвойстваМетодов";
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("Ссылка",СпрСсылка);
		
		строка_эл = строка(СпрСсылка)+", код "+строка(СпрСсылка.Код);
		НачатьТранзакцию();
		Попытка
		
			Блокировка.Заблокировать();
			Р = СпрСсылка.ПолучитьОбъект();
			Р.ПараллельныхПроцессов = Лимит;
			Р.Записать();
			ЗафиксироватьТранзакцию();
		
		Исключение
			ОтменитьТранзакцию();
			т = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			КСП_ЛоггерСервер.Предупреждение_(ИдВызова,"Не обновлен элемент "+строка_эл,"Ошибка обновления: "+т);
		КонецПопытки;
		
	КонецЕсли;
		
КонецПроцедуры

// Возвращает размер пакета для указанного фонового метода. Если не задан - возвращает 1000
//
// Параметры:
//	Наименование 	- строка 	- имя метода с префиксом в виде общего модуля: ОбщийМодуль1.ИмяМетода()
// В параметре Наименование нужно указывать имя того метода,
// который будет запускаться в фоне.
//
// Возвращаемое значение:
//	Тип: число
//
Функция ПолучитьРазмерПакета(Наименование) Экспорт
	
	ИмяКонстанты = "РазмерПакета";
	_РазмерПакета = 1000;
	
	ЭлСправочника = Справочники.КСП_СвойстваМетодов.НайтиПоНаименованию(Наименование, Истина);
	Если НЕ ЗначениеЗаполнено(ЭлСправочника) Тогда
		Возврат _РазмерПакета;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КСП_СвойстваМетодовКонстанты.Значение КАК Значение
		|ИЗ
		|	Справочник.КСП_СвойстваМетодов.Константы КАК КСП_СвойстваМетодовКонстанты
		|ГДЕ
		|	КСП_СвойстваМетодовКонстанты.Ссылка = &Ссылка
		|	И КСП_СвойстваМетодовКонстанты.Имя = &Имя";
	
	Запрос.УстановитьПараметр("Имя", ИмяКонстанты);
	Запрос.УстановитьПараметр("Ссылка", ЭлСправочника);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ТипЗнч(ВыборкаДетальныеЗаписи.Значение.Получить()) <> Тип("Число") Тогда
			Возврат _РазмерПакета;
		КонецЕсли;
		Возврат ВыборкаДетальныеЗаписи.Значение.Получить();
	КонецЦикла;
	
	Возврат _РазмерПакета;
	
КонецФункции

//не надо помещать эту функцию в Повт Использ
Функция ПолучитьПараметрПроцедуры(ИмяПроцедуры, ИмяПараметра) Экспорт
	пр = Неопределено;
	ЭлСправочника = Справочники.КСП_СвойстваМетодов.НайтиПоНаименованию(ИмяПроцедуры, Истина);
	Если НЕ ЗначениеЗаполнено(ЭлСправочника) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Рез = ЭлСправочника.Константы.Найти(ИмяПараметра,"Имя");
	Если Рез <> Неопределено Тогда
		пр = Рез.Значение.Получить();
	КонецЕсли;
	Возврат пр;
КонецФункции

Функция ВключенФлагПрерыванияПроцедуры(ИмяПроцедуры) Экспорт
	ЭлСправочника = Справочники.КСП_СвойстваМетодов.НайтиПоНаименованию(ИмяПроцедуры, Истина);
	Если НЕ ЗначениеЗаполнено(ЭлСправочника) Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат ЭлСправочника.Прерывание;
КонецФункции
